zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
	                                    wpan_mlme_set_req(macKeyTable,
	                                    INDEX_1,    // Index: 1
	                                    &mac_key_table1);
	                                    wpan_mlme_set_req(macKeyTable,
	                                    INDEX_2,    // Index: 2
	                                    &mac_key_table2);
                                    }
                 break;

             case macKeyTable:
                 {
					/*
					* Sync with beacon frames from our coordinator.
					* Use: bool wpan_mlme_sync_req(uint8_t LogicalChannel,
					*                              uint8_t ChannelPage,
					*                              bool TrackBeacon);
					*
					* This does not lead to an immediate reaction.
					*
					* In case we receive beacon frames from our coordinator
					*including
					* a beacon payload, this is indicated in the callback function
					* usr_mlme_beacon_notify_ind().
					*
					* In case the device cannot find its coordinator or later
					*looses
					* synchronization with its parent, this is indicated in the
					* callback function usr_mlme_sync_loss_ind().
					*/
					if(PIBAttributeIndex == INDEX_2 && app_state == APP_IDLE){
						wpan_mlme_get_req(phyCurrentPage,NO_PIB_INDEX);
				    }
                 }
                 break;

              case macDeviceTableEntries:
                 {
					 uint64_t coord_ieee_addr = 0x1234567812345600;
	                 uint8_t mac_dev_table[17] =
	                 {
		                 // DeviceDescriptor
		                 // PANId
		                 (uint8_t)DEFAULT_PAN_ID,
		                 (uint8_t)(DEFAULT_PAN_ID >> 8),
		                 // Device ShortAddress
		                 (uint8_t)coord_addr_spec.Addr.short_address,
		                 (uint8_t)(coord_addr_spec.Addr.short_address >> 8),
		                 // Device ExtAddress
		                 (uint8_t)coord_ieee_addr,
		                 (uint8_t)(coord_ieee_addr >> 8),
		                 (uint8_t)(coord_ieee_addr >> 16),
		                 (uint8_t)(coord_ieee_addr >> 24),
		                 (uint8_t)(coord_ieee_addr >> 32),
		                 (uint8_t)(coord_ieee_addr >> 40),
		                 (uint8_t)(coord_ieee_addr >> 48),
		                 (uint8_t)(coord_ieee_addr >> 56),
		                 // FrameCounter
		                 0, 0, 0, 0,
		                 // Exempt
		                 0
	                 };

	                 wpan_mlme_set_req(macDeviceTable,
	                 0,    // Index: 0
	                 &mac_dev_table);
                 }
                 break;

             case macDeviceTable:
                 {
	                 /* Use DSN start value as in ZIP test spec. */
	                 uint8_t new_dsn = 0x0;

	                 wpan_mlme_set_req(macDSN,
	                 NO_PIB_INDEX,
	                 &new_dsn);
                 }
                 break;

              case macDSN:
                 {
	                 /* Use DSN start value as in ZIP test spec. */
	                 uint32_t frame_counter = 1;

	                 wpan_mlme_set_req(macFrameCounter,
	                 NO_PIB_INDEX,
	                 &frame_counter);
                 }
                 break;

              case macFrameCounter:
				 {
					 wpan_mlme_get_req(macKeyTable,deviceShortAddress-1);
				 }
                 break;

                 default:
                 // undesired PIB attribute; restart
                 wpan_mlme_reset_req(true);
                 break;
        }
    }

    /* Keep compiler happy. */
    PIBAttributeIndex = PIBAttributeIndex;
}
#else
/*
 * @brief Callback function usr_mlme_set_conf
 *
 * @param status        Result of requested PIB attribute set operation
 * @param PIBAttribute  Updated PIB attribute
 */
void usr_mlme_set_conf(uint8_t status,
		uint8_t PIBAttribute)
{
	if ((status == MAC_SUCCESS) && (PIBAttribute == macPANId)) {
		/*
		 * Set the Coordinator Short Address of the scanned network.
		 * This is required in order to perform a proper sync
		 * before assocation.
		 */
		wpan_mlme_set_req(macCoordShortAddress, &coord_addr_spec.Addr);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macCoordShortAddress)) {
		/*
		 * Sync with beacon frames from our coordinator.
		 * Use: bool wpan_mlme_sync_req(uint8_t LogicalChannel,
		 *                              uint8_t ChannelPage,
		 *                              bool TrackBeacon);
		 *
		 * This does not lead to an immediate reaction.
		 *
		 * In case we receive beacon frames from our coordinator
		 *including
		 * a beacon payload, this is indicated in the callback function
		 * usr_mlme_beacon_notify_ind().
		 *
		 * In case the device cannot find its coordinator or later
		 *looses
		 * synchronization with its parent, this is indicated in the
		 * callback function usr_mlme_sync_loss_ind().
		 */
		wpan_mlme_sync_req(current_channel,
				current_channel_page,
				1);
	} else {
		/* Set proper state of application. */
		app_state = APP_IDLE;

		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}
}
#endif


#if (MAC_START_REQUEST_CONFIRM == 1)
void usr_mlme_start_conf(uint8_t status)
{
}

#endif  /* (MAC_START_REQUEST_CONFIRM == 1) */

/*
 * Callback function usr_mlme_sync_loss_ind
 *
 * @param LossReason     Reason for synchronization loss.
 * @param PANId          The PAN identifier with which the device lost
 *                       synchronization or to which it was realigned.
 * @param LogicalChannel The logical channel on which the device lost
 *                       synchronization or to which it was realigned.
 * @param ChannelPage    The channel page on which the device lost
 *                       synchronization or to which it was realigned.
 */
void usr_mlme_sync_loss_ind(uint8_t LossReason,
		uint16_t PANId,
		uint8_t LogicalChannel,
		uint8_t ChannelPage)
{
	/*
	 * Once we lost sync this the coordinator we need to re-sync.
	 * Since we the network parameter are not supposed ot change,
	 * use the already known parameters form our coordinator.
	 */
	wpan_mlme_sync_req(LogicalChannel,
			ChannelPage,
			1);

	/* Keep compiler happy. */
	LossReason = LossReason;
	PANId = PANId;
}

