zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
/* Alert to indicate something has gone wrong in the application */
static void app_alert(void)
{
	while (1) {
		#if LED_COUNT > 0
		LED_Toggle(LED0);
		#endif

		#if LED_COUNT > 1
		LED_Toggle(LED1);
		#endif

		#if LED_COUNT > 2
		LED_Toggle(LED2);
		#endif

		#if LED_COUNT > 3
		LED_Toggle(LED3);
		#endif

		#if LED_COUNT > 4
		LED_Toggle(LED4);
		#endif

		#if LED_COUNT > 5
		LED_Toggle(LED5);
		#endif

		#if LED_COUNT > 6
		LED_Toggle(LED6);
		#endif

		#if LED_COUNT > 7
		LED_Toggle(LED7);
		#endif
		delay_us(0xFFFF);
	}
}

/*
 * @brief Callback function indicating network search
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void network_search_indication_cb(void *parameter)
{
	LED_Toggle(LED_NWK_SETUP);

	/* Re-start timer again. */
	/*sw_timer_start(APP_TIMER,
			500000,
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)network_search_indication_cb,
			NULL);*/


	parameter = parameter; /* Keep compiler happy. */
}

/*
 * @brief Callback function for switching off the LED after data reception
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void rx_data_led_off_cb(void *parameter)
{
	LED_Off(LED_DATA);

	parameter = parameter; /* Keep compiler happy. */
}

#if (defined ENABLE_SLEEP || defined RTC_SLEEP)
static void enter_sleep(uint32_t timeout)
{   
    sys_sleep = true;
	#ifdef ENABLE_SLEEP
	ENTER_CRITICAL_REGION();
	common_tc_stop();
	common_tc_init();
	set_common_tc_overflow_callback(hw_overflow_cb);
	set_common_tc_expiry_callback(hw_expiry_cb);
	timeout = timeout-150;
	sw_timer_start(APP_TIMER_SLEEP,timeout,
	SW_TIMEOUT_RELATIVE,
	(FUNC_PTR)wakeup_cb,
	NULL);
    LEAVE_CRITICAL_REGION();
	system_set_sleepmode(SYSTEM_SLEEPMODE_IDLE_2);
	system_sleep();
    #endif
    #ifdef RTC_SLEEP
	configure_rtc_count();
/* Configure and enable callback */
   configure_rtc_callbacks();
   /* Set period */
	res = timeout % 1000;
	timeout = timeout/1000;	
	rtc_count_set_period(timeout);
	system_set_sleepmode(SYSTEM_SLEEPMODE_STANDBY);
	system_sleep();
	#endif
	
}
#ifdef RTC_SLEEP
void configure_rtc_count(void)
{
	//! [init_conf]
	struct rtc_count_config config_rtc_count;
	rtc_count_get_config_defaults(&config_rtc_count);
	//! [init_conf]

	//! [set_config]
	config_rtc_count.prescaler           = RTC_COUNT_PRESCALER_DIV_1;
	config_rtc_count.mode                = RTC_COUNT_MODE_16BIT;
	config_rtc_count.continuously_update = true;
	//! [set_config]
	//! [init_rtc]
	rtc_count_init(&config_rtc_count);
	//! [init_rtc]

	//! [enable]
	rtc_count_enable();
	//! [enable]
}
//! [initialize_rtc]

//! [setup_callback]
void configure_rtc_callbacks(void)
{
	//! [reg_callback]
	rtc_count_register_callback(
	rtc_overflow_callback, RTC_COUNT_CALLBACK_OVERFLOW);
	//! [reg_callback]
	//! [en_callback]
	rtc_count_enable_callback(RTC_COUNT_CALLBACK_OVERFLOW);
	//! [en_callback]
}
void rtc_overflow_callback(void)
{
	//! [overflow_act]
	/* Do something on RTC overflow here */
	wakeup_cb(NULL);
	//! [overflow_act]
}
#endif
void wakeup_cb(void *parameter)
{
	sys_sleep = false;
    #ifdef ENABLE_SLEEP
	ENTER_CRITICAL_REGION();
	common_tc_stop();
	common_tc_init();
	set_common_tc_overflow_callback(hw_overflow_cb);
	set_common_tc_expiry_callback(hw_expiry_cb);
	sw_timer_stop(APP_TIMER_SLEEP);
    LEAVE_CRITICAL_REGION();
	#endif
	mac_wakeup(res);
	
}
#endif

